Revit 2024 API
PerformanceAdviser.ExecuteRules Method
Overload List
Name | Description
ExecuteRules(Document, IList<PerformanceAdviserRuleId>)
 Executes selected rules on a given document.
ExecuteRules(Document, IList<Int32>)
 Executes selected rules on a given document.
See Also
PerformanceAdviser Class
PerformanceAdviser Members
Autodesk.Revit.DB Namespace